package com.makhtotat.ok.makhtotat;

/**
 * Created by ok on 23/10/2017.
 */

public class names {

    static String[] a = {

            "قصيدتان",
            "القلائد البرهانية في الفرائض",
            "قوت المغتذي علي جامع الترمزي",
            "الكافية لابن الحاجب",
            "الكافيه",


            "نظم غاية التقريب"
            , "شرح حزب الامام النووي"
            , "وسيلة البرية الي الفوائد الشنشوريه"
            , "الخلاصة المرضية على متن الشاطبية",
            "رسالة في النحو",


            "حاشبة الباجوري على شرح ابن قاس"
            , "ديوان منتجب الدين العاني"
            , "انساب الشرفاء الادارسة"
            , "كتاب الخواص الكبير",
            "الشفا بتعريف حقوق المصطفى"

            , "كتاب في الفقه الحنفي"
            , "شرح بناء"
            , "حاشية البرماوي علي شرح الغاية"
            , "السير والسلوك إلى ملك الملوك"
            , "حاشية علي شرح الازهرية"

            , "الرسالة القشيرية"
            ,"مجموعة أوله كتاب في الشعر",
            "بغية الطلاب في العمل بالاسطرلاب",
            "ديوان شعر",
            "كنز المعاني في شرح حرز الأماني",

            "رسالة في منازل القمر",
            "منار الأنرار",
            "كتاب فيه فوائد الأذكار",
            "مجموعة أوله الرسالة المهدوية",
            "شرح ديوان بن الفارض",

            "التيسير",
            "خزانة الفقه"
            , "المختار من نوادر الأخبار",
            "مراقي الفلاح لامداد الفتاح شرح نور الإيضاح ونجاة الأرواح",
            "الجامع الصحيح",

            "مختصر قرة العيون النواظر في الوجوه والنظائر، كلاهما",
            "الدر النثير على أجوبة أبي الحسن الصغير",
            "القوت بشرح الياقوت كلاهما",
            "السراجية في الفرائض ، السجاوندى",
            "صحيفة زين العابدين",

            "احياء علوم الدين",
            "اسرار الفقراء والمساكين ",
            "فتاوي قارئ الهداية",
            "المنهج القويم شرح مسائل التعليم",
            "مختارات ادبية ( شعر ونثر )",

            "الاعلام بقواطع الاسلام ",
            "شرح العوامل المائة للبركلي ",
            "مسلك الشقات في نصوص الصفات",
            "كتاب اللطائف",
            "نسمات الاسحار علي شرح المنار",

            "مختصر الدر الثمين والمورد المعين",
            "تقرير الاجهوري علي حاشية الامير علي شرح الملوي علي السمرقندية ",
            "الخصال المكفرة للذنوب المقمدمة والمؤخرة",
            "حاشية اللاري علي الفوائد الضيائية للجامي علي الكافية لابن الحاجب",
            "مزيد النعمة في جمع اقوال الأئمة",

            "شقائق الاترنج في دقائق الغنج",
            "الكلم الجوامع في بيان مسأله الاصول لجمع الجوامع",
            "الاذكار وحلية الابرار وشعار الاخيار في تلخيص الدعوات والاذكار المستحبة في الليل و النهار",
            "تبيين الحقائق شرح كنز الدقائق",
            "الشقائق النعمانية في علماء الدولة العثمانية",

            "غرر اللطائف مختصر عوارف المعارف للسهروردي",
            "كشف اللثام والابهام عن كتاب قواعد الاحكام للحلي"


    };
}
